Revit 2027 API
ProjectPosition(Double, Double, Double, Double) Constructor
 Construct a new ProjectPosition with the specified East/West offset, North/South offset, elevation offset, and angle of rotation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ProjectPosition(
	double ew,
	double ns,
	double elevation,
	double angle
)
Public Sub New (
	ew As Double,
	ns As Double,
	elevation As Double,
	angle As Double
)
public:
ProjectPosition(
	double ew,
	double ns,
	double elevation,
	double angle
)
new :
        ew : float *
        ns : float *
        elevation : float *
        angle : float -> ProjectPosition
Parameters
ew Double
 East/West offset
ns Double
 North/South offset
elevation Double
 Elevation offset
angle Double
 Rotation from true north, in radians
Remarks
 The angle parameter must be in the range of -PI to PI. If the parameter value is outside that range, it will be shifted by 2*PI until it falls into range.
See Also
Reference
ProjectPosition Class
ProjectPosition Overload
Autodesk.Revit.DB Namespace